palarum/mm-iot-zephyr/drivers/spi/spi_ll_stm32_optim.c
	return pm_device_runtime_enable(dev);
}

#ifdef CONFIG_PM_DEVICE
static int spi_stm32_pm_action(const struct device *dev, enum pm_device_action action)
{
	const struct spi_stm32_config *config = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int err;

	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		if (!spi_stm32_is_subghzspi(dev)) {
			/* Set pins to active state */
			err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
			if (err < 0) {
				return err;
			}
		}

		/* enable clock */
		err = clock_control_on(clk, (clock_control_subsys_t)&config->pclken[0]);
		if (err != 0) {
			LOG_ERR("Could not enable SPI clock");
			return err;
		}
		break;
	case PM_DEVICE_ACTION_SUSPEND:
		/* Stop device clock. */
		err = clock_control_off(clk, (clock_control_subsys_t)&config->pclken[0]);
		if (err != 0) {
			LOG_ERR("Could not disable SPI clock");
			return err;
		}

		if (!spi_stm32_is_subghzspi(dev)) {
			/* Move pins to sleep state */
			err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_SLEEP);
			if ((err < 0) && (err != -ENOENT)) {
				/*
				 * If returning -ENOENT, no pins where defined for sleep mode :
				 * Do not output on console (might sleep already) when going to
				 * sleep,
				 * "SPI pinctrl sleep state not available"
				 * and don't block PM suspend.
				 * Else return the error.
				 */
				return err;
			}
		}
		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}
#endif /* CONFIG_PM_DEVICE */

#ifdef CONFIG_SPI_STM32_INTERRUPT
#define STM32_SPI_IRQ_HANDLER_DECL(id)                                                             \
	static void spi_stm32_irq_config_func_##id(const struct device *dev)
#define STM32_SPI_IRQ_HANDLER_FUNC(id) .irq_config = spi_stm32_irq_config_func_##id,
#define STM32_SPI_IRQ_HANDLER(id)                                                                  \
	static void spi_stm32_irq_config_func_##id(const struct device *dev)                       \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(id), DT_INST_IRQ(id, priority), spi_stm32_isr,            \
			    DEVICE_DT_INST_GET(id), 0);                                            \
		irq_enable(DT_INST_IRQN(id));                                                      \
	}
#else
#define STM32_SPI_IRQ_HANDLER_DECL(id)
#define STM32_SPI_IRQ_HANDLER_FUNC(id)
#define STM32_SPI_IRQ_HANDLER(id)
#endif /* CONFIG_SPI_STM32_INTERRUPT */

#define SPI_DMA_CHANNEL_INIT(index, dir, dir_cap, src_dev, dest_dev)                               \
	.dma_dev = DEVICE_DT_GET(STM32_DMA_CTLR(index, dir)),                                      \
	.channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),                                 \
	.dma_cfg =                                                                                 \
		{                                                                                  \
			.dma_slot = STM32_DMA_SLOT(index, dir, slot),                              \
			.channel_direction =                                                       \
				STM32_DMA_CONFIG_DIRECTION(STM32_DMA_CHANNEL_CONFIG(index, dir)),  \
			.source_data_size = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(                \
				STM32_DMA_CHANNEL_CONFIG(index, dir)),                             \
			.dest_data_size = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(                 \
				STM32_DMA_CHANNEL_CONFIG(index, dir)),                             \
			.source_burst_length = 1, /* SINGLE transfer */                            \
			.dest_burst_length = 1,   /* SINGLE transfer */                            \
			.channel_priority =                                                        \
				STM32_DMA_CONFIG_PRIORITY(STM32_DMA_CHANNEL_CONFIG(index, dir)),   \
			.dma_callback = dma_callback,                                              \
			.block_count = 2,                                                          \
	},                                                                                         \
	.src_addr_increment =                                                                      \
		STM32_DMA_CONFIG_##src_dev##_ADDR_INC(STM32_DMA_CHANNEL_CONFIG(index, dir)),       \
	.dst_addr_increment =                                                                      \
		STM32_DMA_CONFIG_##dest_dev##_ADDR_INC(STM32_DMA_CHANNEL_CONFIG(index, dir)),      \
	.fifo_threshold = STM32_DMA_FEATURES_FIFO_THRESHOLD(STM32_DMA_FEATURES(index, dir)),

#ifdef CONFIG_SPI_STM32_DMA
#define SPI_DMA_CHANNEL(id, dir, DIR, src, dest)                                                   \
	.dma_##dir = {COND_CODE_1(DT_INST_DMAS_HAS_NAME(id, dir),                                  \
				  (SPI_DMA_CHANNEL_INIT(id, dir, DIR, src, dest)), (NULL))},
#define SPI_DMA_STATUS_SEM(id)                                                                     \
	.status_sem = Z_SEM_INITIALIZER(spi_stm32_dev_data_##id.status_sem, 0, 1),
#else
#define SPI_DMA_CHANNEL(id, dir, DIR, src, dest)
#define SPI_DMA_STATUS_SEM(id)
#endif /* CONFIG_SPI_STM32_DMA */

#define SPI_SUPPORTS_FIFO(id) DT_INST_NODE_HAS_PROP(id, fifo_enable)
#define SPI_GET_FIFO_PROP(id) DT_INST_PROP(id, fifo_enable)
#define SPI_FIFO_ENABLED(id)  COND_CODE_1(SPI_SUPPORTS_FIFO(id), (SPI_GET_FIFO_PROP(id)), (0))

#define STM32_SPI_INIT(id)                                                                         \
	STM32_SPI_IRQ_HANDLER_DECL(id);                                                            \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(id);                                                                \
                                                                                                   \
	static const struct stm32_pclken pclken_##id[] = STM32_DT_INST_CLOCKS(id);                 \
                                                                                                   \
	static const struct spi_stm32_config spi_stm32_cfg_##id = {                                \
		.spi = (SPI_TypeDef *)DT_INST_REG_ADDR(id),                                        \
		.pclken = pclken_##id,                                                             \
		.pclk_len = DT_INST_NUM_CLOCKS(id),                                                \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(id),                                        \
		.fifo_enabled = SPI_FIFO_ENABLED(id),                                              \
		STM32_SPI_IRQ_HANDLER_FUNC(id) IF_ENABLED(                                         \
			DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_subghz),                            \
			(.use_subghzspi_nss = DT_INST_PROP_OR(id, use_subghzspi_nss, false), ))    \
			IF_ENABLED(DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi),                      \
				   (.midi_clocks = DT_INST_PROP(id, midi_clock), ))                \
				IF_ENABLED(DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi),              \
					   (.mssi_clocks = DT_INST_PROP(id, mssi_clock), ))};      \
                                                                                                   \
	static struct spi_stm32_data spi_stm32_dev_data_##id = {                                   \
		SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_##id, ctx),                               \
		SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_##id, ctx),                               \
		SPI_DMA_CHANNEL(id, rx, RX, PERIPHERAL, MEMORY)                                    \
			SPI_DMA_CHANNEL(id, tx, TX, MEMORY, PERIPHERAL) SPI_DMA_STATUS_SEM(id)     \
				SPI_CONTEXT_CS_GPIOS_INITIALIZE(DT_DRV_INST(id), ctx)};            \
                                                                                                   \
	PM_DEVICE_DT_INST_DEFINE(id, spi_stm32_pm_action);                                         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(id, &spi_stm32_init, PM_DEVICE_DT_INST_GET(id),                      \
			      &spi_stm32_dev_data_##id, &spi_stm32_cfg_##id, POST_KERNEL,          \
			      CONFIG_SPI_INIT_PRIORITY, &api_funcs);                               \
                                                                                                   \
	STM32_SPI_IRQ_HANDLER(id)

DT_INST_FOREACH_STATUS_OKAY(STM32_SPI_INIT)
